text/chart_style/tdd_hello/1st_hello_method.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-10-07 月 11:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>first lesson for ruby novice &#x2013; hello method --</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">first lesson for ruby novice &#x2013; hello method --</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8fdb748">1. coding原則に対する基本的見解</a></li>
<li><a href="#org7b5d826">2. 場所の記憶と自然言語</a></li>
<li><a href="#orgf1503e1">3. hello world</a></li>
<li><a href="#org7f4b1a9">4. 振る舞いを持たす</a></li>
<li><a href="#orgd3785b6">5. 言語は英語から</a></li>
<li><a href="#orgfab14b3">6. 長くなったら，隠せ</a></li>
<li><a href="#org4b71e29">7. 今日の教え=1=- red green refactoring -</a></li>
<li><a href="#org4b7f16b">8. 今日の教え=2=- editor -</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8fdb748" class="outline-2">
<h2 id="org8fdb748"><span class="section-number-2">1</span> coding原則に対する基本的見解</h2>
<div class="outline-text-2" id="text-1">
<p>
いくつかの言語でcodingしてきて，rubyが本当にすんなり腑に落ちているのですが，
なぜかを考えるとよくわかりませんでした．この頃気がついたことがあるので，
それに従ったrubyの学習を進めて見ます．
</p>
</div>
</div>

<div id="outline-container-org7b5d826" class="outline-2">
<h2 id="org7b5d826"><span class="section-number-2">2</span> 場所の記憶と自然言語</h2>
<div class="outline-text-2" id="text-2">
<p>
筆者は記憶がすごく苦手です．人の名前とか，電話番号とかほとんど覚えていません．
昔は，「画像記憶が得意やからいいやん」とか思ってたんですが，人の顔の見分けも
つかんようになってきたんで，これもダメみたいです．
</p>

<p>
で，残ったのは何かというと
　「場所の記憶と自然言語」
です．webだとどこのボタンをクリックして，とかこの画面の右上の方とか覚えてますよね．
あるいは，英単語は比較的覚えています．
</p>

<p>
Actaってのがありました．outlinerの走りなんですが，そこで発明されたのが，
toggle表示(folding, hide)です．それまではMac OSがGUIの走りのはずで
そのデフォルトはアイコンでした．それがいつの間にかtoggle表示が当たり前に
なったんですが，そのメタファがプログラミングでも実践されていて．．．
さらにemacsのorg-modeなんかになるとそれが徹底されてきています．
</p>

<p>
そこでさらにmy_helpが私の中では最新なんですが，それはまた別の話．
まずはtoggleがどうcodingに効くかというところから進めていきます．
</p>
</div>
</div>

<div id="outline-container-orgf1503e1" class="outline-2">
<h2 id="orgf1503e1"><span class="section-number-2">3</span> hello world</h2>
<div class="outline-text-2" id="text-3">
<p>
まずはお決まりからいきましょう．hello worldです．
</p>

<pre class="example">
&gt; emacs hello.rb

</pre>

<p>
でeditorを起動して，次のcode
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span class="linenr">1: </span>puts <span style="font-style: italic;">"Hello world."</span>
</pre>
</div>

<p>
を打ち込んで保存しましょう(C-x C-s, C-z)．動かしてみると
</p>

<pre class="example">
&gt; ruby hello.rb

</pre>

<p>
ちゃんと動いています？　codeを書いていくコツは「チラ見」です．
一行書いたら動かしてみるという癖をつけましょう．
</p>
</div>
</div>

<div id="outline-container-org7f4b1a9" class="outline-2">
<h2 id="org7f4b1a9"><span class="section-number-2">4</span> 振る舞いを持たす</h2>
<div class="outline-text-2" id="text-4">
<p>
もう少し，このアプリに振る舞いを追加しましょう．
対話的するために，先ほどの命令の後ろに引数をつけて，
名前を返しくれると嬉しいでしょ？
</p>

<pre class="example">
&gt; ruby hello.rb bob
Hello bob.  Nice to see you.
</pre>
<p>
なんてね．
</p>

<p>
これを実装すると
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span class="linenr">2: </span>puts <span style="font-style: italic;">"Hello </span><span style="font-weight: bold; font-style: italic;">#{ARGV[0]}</span><span style="font-style: italic;">."</span>
</pre>
</div>
<p>
になります．そうこれでいいんですが，もう少し高尚な感じで．．．
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span class="linenr">3: </span>tmp1 = <span style="font-weight: bold; text-decoration: underline;">ARGV</span>[0]
<span class="linenr">4: </span>puts <span style="font-style: italic;">"Hello </span><span style="font-weight: bold; font-style: italic;">#{tmp1}</span><span style="font-style: italic;">."</span>
</pre>
</div>
<p>
とでもしましょう．
</p>
</div>
</div>

<div id="outline-container-orgd3785b6" class="outline-2">
<h2 id="orgd3785b6"><span class="section-number-2">5</span> 言語は英語から</h2>
<div class="outline-text-2" id="text-5">
<p>
これをmethodにしたら，
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">func</span>(hoge)
  puts <span style="font-style: italic;">"Hello </span><span style="font-weight: bold; font-style: italic;">#{hoge}</span><span style="font-style: italic;">."</span>
<span style="font-weight: bold;">end</span>

hoho = <span style="font-weight: bold; text-decoration: underline;">ARGV</span>[0]
func(hoho)
</pre>
</div>

<p>
これを動かしてみましょう．
</p>

<pre class="example">
&gt; ruby hello.rb bob

</pre>

<p>
とちゃんと動きます．これでは何をしているのかわからないので，
コメントをつけましょう．
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">method: func</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">input:  hoge is a name</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">output: puts greetings</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">return: nil</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">func</span>(hoge)
  puts <span style="font-style: italic;">"Hello </span><span style="font-weight: bold; font-style: italic;">#{hoge}</span><span style="font-style: italic;">."</span>
<span style="font-weight: bold;">end</span>

honya = <span style="font-weight: bold; text-decoration: underline;">ARGV</span>[0] <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">get hoho from argv</span>
func(honya) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">call hello with a name honya</span>
</pre>
</div>

<p>
英語でしっかりとコメントが書ければ世界中に通用するcodeが書ける&#x2026;
んでしょうかね？
コメントをぐちゃぐちゃ書くんじゃなくて，
もっとわかりやすい名前（method名，変数名）
にしたくなるでしょう？
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">puts_hello</span> name
  puts <span style="font-style: italic;">"Hello </span><span style="font-weight: bold; font-style: italic;">#{name}</span><span style="font-style: italic;">."</span>
<span style="font-weight: bold;">end</span>

name = <span style="font-weight: bold; text-decoration: underline;">ARGV</span>[0]
puts_hello name
</pre>
</div>

<p>
こっちの方が短くてスッキリしていて圧倒的にいいでしょ？　
適切な英単語を使えば，要らん説明が省けます．
これが言語は英語からという意味です．
</p>
</div>
</div>

<div id="outline-container-orgfab14b3" class="outline-2">
<h2 id="orgfab14b3"><span class="section-number-2">6</span> 長くなったら，隠せ</h2>
<div class="outline-text-2" id="text-6">
<p>
もしoptionのnameを打つのを忘れたら，
問い合わせてくれると，
user interfaceという感じがもっとするでしょう？
</p>

<div class="org-src-container">
<pre class="src src-ruby">name = <span style="font-weight: bold; text-decoration: underline;">ARGV</span>[0]
<span style="font-weight: bold;">if</span> name == <span style="font-weight: bold; font-style: italic;">nil</span>
  puts <span style="font-style: italic;">"What\'s your name?"</span>
  name = gets.chomp
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
というのをname=の下につけましょう[1]．ちょっと動かして見ましょう．
</p>

<pre class="example">
&gt; ruby hello.rb

</pre>

<p>
意図通りに動いていますか？　でもmain loopが長くなってきちゃいました．
そこで，これもmethodに切り出します．
領域を指定して(C-spaceで先頭を指定して移動),C-wでcut, 移動してC-yでyankです．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">gets_name</span>
  name = <span style="font-weight: bold; text-decoration: underline;">ARGV</span>[0]
  <span style="font-weight: bold;">if</span> name == <span style="font-weight: bold; font-style: italic;">nil</span>
    puts <span style="font-style: italic;">"What\'s your name?"</span>
    name = gets.chomp
  <span style="font-weight: bold;">end</span>
  <span style="font-weight: bold;">return</span> name
<span style="font-weight: bold;">end</span>

name = gets_name
</pre>
</div>
<p>
この時，領域を指定してM-x indent-regionとしてください．あるいはC-x TAB.
これだけでもだいぶ読みやすくなったでしょ？
</p>

<p>
もっとできます．
main loopにcursorを持って行って，'C-c @ C-l'と打ってみてください．
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">puts_hello</span> name...<span style="font-weight: bold;">end</span>

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">gets_name...end</span>

name = gets_name
puts_hello name
</pre>
</div>

<p>
これがoutlineによるtoggle表示からきたすごいメタファなんですよ．
何をしているのか知らなくていい部分は隠してしまおうというのが，
methodに切り分ける理由なんです．
</p>
</div>
</div>

<div id="outline-container-org4b71e29" class="outline-2">
<h2 id="org4b71e29"><span class="section-number-2">7</span> 今日の教え=1=- red green refactoring -</h2>
<div class="outline-text-2" id="text-7">
<p>
codingの基本操作を振り返っておきます．
</p>
<ul class="org-ul">
<li>仕様 : 振る舞いを決めて，</li>
<li>実装 : code書いて，</li>
<li>テスト : 確認して，</li>
<li>リファクト : 修正していく．</li>
</ul>
<p>
これの繰り返しです．この流れを表す
</p>
<div class="org-src-container">
<pre class="src src-bash">red green refactoring
</pre>
</div>
<p>
という標語があります．忘れないでね．
</p>
</div>
</div>
<div id="outline-container-org4b7f16b" class="outline-2">
<h2 id="org4b7f16b"><span class="section-number-2">8</span> 今日の教え=2=- editor -</h2>
<div class="outline-text-2" id="text-8">
<p>
ここで示した優秀なeditorのmeritは納得いただけましたでしょうか？
必須操作を少しだけリストアップしておくと，
</p>
<ol class="org-ol">
<li>editのkey-bind</li>
<li>syntax high_lighting</li>
<li>code hiding, show</li>
<li>block copy, 移動</li>
<li>query-replace</li>
<li>shellとの連携</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2019-10-07 月 11:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
